* 关于autojs代码加密的问题
  - 我发现了autojs自带的打包基本上只要有一键破解工具就没有秘密可言了
  - js混淆加密可以解决这个问题

#+BEGIN_SRC python :results output
  a = 1+3
  print(a)
#+END_SRC

#+RESULTS:
: 4

* 热更新
** 什么是热更新
   无需重新安装的前提下进行部分代码的更新
** 原理
   1. 将需要更新的内容覆盖写入到
   2. 脚本引擎重启更新脚本
** 例子
   已经写成了模块在hot_update

* 远程脚本 <2021-02-25 四>
** 原理 :: 从远程获取到代码内容通过eval执行字符串格式的代码
** 具体实现
   1. 根据code来请求脚本数据(main.js and other)
   2. 通过url访问文件内容，并把他写进数组返回到main.js
   3. 在main.js通过eval在主脚本执行
** 遇到的问题
   1. json的格式化，远程的json数据一定要用正确的方法把他变为字符串返回
   2. eval得在main.js中执行才会得到正确的效果
